# SQL Basics - Complete Tutorial

This notebook covers all the fundamental SQL concepts with explanations and examples.

## Table of Contents
1. Introduction to SQL
2. Database and Table Creation
3. Data Types
4. INSERT - Adding Data
5. SELECT - Querying Data
6. WHERE - Filtering Data
7. UPDATE - Modifying Data
8. DELETE - Removing Data
9. ORDER BY - Sorting Results
10. Aggregate Functions
11. GROUP BY and HAVING
12. JOINS
13. Subqueries
14. DISTINCT
15. LIMIT and OFFSET
16. Indexes
17. Constraints
18. Views

## 1. Introduction to SQL

**SQL (Structured Query Language)** is a standard language for managing and manipulating relational databases.

### Key Points:
- SQL is used to communicate with databases
- It can create, read, update, and delete data (CRUD operations)
- SQL is case-insensitive (SELECT = select = SeLeCt)
- Each SQL statement ends with a semicolon (;)

In [37]:
# Setup: Install and import SQLite for demonstration
import sqlite3
import pandas as pd

# Create a connection to an in-memory database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

print("Database connection established!")

Database connection established!

## 2. Database and Table Creation

### CREATE DATABASE
Creates a new database (note: SQLite uses files, so this is conceptual)

### CREATE TABLE
Creates a new table with specified columns and data types

In [38]:
# Create a simple table
cursor.execute('''
CREATE TABLE employees (
    employee_id INTEGER PRIMARY KEY,
    first_name TEXT NOT NULL,
    last_name TEXT NOT NULL,
    email TEXT UNIQUE,
    department TEXT,
    salary REAL,
    hire_date DATE
)
''')

print("Table 'employees' created successfully!")

Table 'employees' created successfully!

## 3. Data Types

Common SQL data types:

### Numeric Types:
- **INTEGER**: Whole numbers (1, 2, 100)
- **REAL/FLOAT**: Decimal numbers (3.14, 99.99)
- **DECIMAL(p,s)**: Fixed precision decimals

### String Types:
- **TEXT/VARCHAR(n)**: Variable-length strings
- **CHAR(n)**: Fixed-length strings

### Date/Time Types:
- **DATE**: Date values (YYYY-MM-DD)
- **TIME**: Time values (HH:MM:SS)
- **DATETIME/TIMESTAMP**: Date and time combined

### Other Types:
- **BOOLEAN**: True/False values
- **BLOB**: Binary data

## 4. INSERT - Adding Data

The INSERT statement adds new records to a table.

### Syntax:
```sql
INSERT INTO table_name (column1, column2, ...)
VALUES (value1, value2, ...);
```

In [39]:
# Insert single record
cursor.execute('''
INSERT INTO employees (employee_id, first_name, last_name, email, department, salary, hire_date)
VALUES (1, 'John', 'Doe', 'john.doe@company.com', 'IT', 75000, '2020-01-15')
''')

# Insert multiple records
employees_data = [
    (2, 'Jane', 'Smith', 'jane.smith@company.com', 'HR', 65000, '2019-03-20'),
    (3, 'Mike', 'Johnson', 'mike.j@company.com', 'IT', 80000, '2018-07-10'),
    (4, 'Sarah', 'Williams', 'sarah.w@company.com', 'Sales', 70000, '2021-02-01'),
    (5, 'Tom', 'Brown', 'tom.b@company.com', 'IT', 72000, '2020-11-15'),
    (6, 'Emily', 'Davis', 'emily.d@company.com', 'HR', 68000, '2019-09-05')
]

cursor.executemany('''
INSERT INTO employees VALUES (?, ?, ?, ?, ?, ?, ?)
''', employees_data)

conn.commit()
print("Data inserted successfully!")

Data inserted successfully!

## 5. SELECT - Querying Data

SELECT retrieves data from one or more tables.

### Basic Syntax:
```sql
SELECT column1, column2, ...
FROM table_name;
```

### Select all columns:
```sql
SELECT * FROM table_name;
```

In [40]:
# Select all columns
df = pd.read_sql_query("SELECT * FROM employees", conn)
print("All employees:")
print(df)
print()

All employees:
   employee_id first_name last_name                   email department  \
0            1       John       Doe    john.doe@company.com         IT
1            2       Jane     Smith  jane.smith@company.com         HR
2            3       Mike   Johnson      mike.j@company.com         IT
3            4      Sarah  Williams     sarah.w@company.com      Sales
4            5        Tom     Brown       tom.b@company.com         IT
5            6      Emily     Davis     emily.d@company.com         HR

    salary   hire_date
0  75000.0  2020-01-15
1  65000.0  2019-03-20
2  80000.0  2018-07-10
3  70000.0  2021-02-01
4  72000.0  2020-11-15
5  68000.0  2019-09-05

In [41]:
# Select specific columns
df = pd.read_sql_query("SELECT first_name, last_name, department FROM employees", conn)
print("Selected columns:")
print(df)

Selected columns:
  first_name last_name department
0       John       Doe         IT
1       Jane     Smith         HR
2       Mike   Johnson         IT
3      Sarah  Williams      Sales
4        Tom     Brown         IT
5      Emily     Davis         HR

## 6. WHERE - Filtering Data

WHERE clause filters records based on conditions.

### Operators:
- **=**: Equal to
- **<>** or **!=**: Not equal
- **>**: Greater than
- **<**: Less than
- **>=**: Greater than or equal
- **<=**: Less than or equal
- **BETWEEN**: Between a range
- **LIKE**: Pattern matching
- **IN**: Matches any value in a list
- **AND/OR/NOT**: Logical operators

In [42]:
# WHERE with equality
df = pd.read_sql_query("SELECT * FROM employees WHERE department = 'IT'", conn)
print("IT Department employees:")
print(df)
print()

IT Department employees:
   employee_id first_name last_name                 email department   salary  \
0            1       John       Doe  john.doe@company.com         IT  75000.0
1            3       Mike   Johnson    mike.j@company.com         IT  80000.0
2            5        Tom     Brown     tom.b@company.com         IT  72000.0

    hire_date
0  2020-01-15
1  2018-07-10
2  2020-11-15

In [43]:
# WHERE with comparison
df = pd.read_sql_query("SELECT * FROM employees WHERE salary > 70000", conn)
print("Employees with salary > 70000:")
print(df)
print()

Employees with salary > 70000:
   employee_id first_name last_name                 email department   salary  \
0            1       John       Doe  john.doe@company.com         IT  75000.0
1            3       Mike   Johnson    mike.j@company.com         IT  80000.0
2            5        Tom     Brown     tom.b@company.com         IT  72000.0

    hire_date
0  2020-01-15
1  2018-07-10
2  2020-11-15

In [44]:
# WHERE with AND/OR
df = pd.read_sql_query("""
SELECT * FROM employees 
WHERE department = 'IT' AND salary >= 75000
""", conn)
print("IT employees with salary >= 75000:")
print(df)
print()

IT employees with salary >= 75000:
   employee_id first_name last_name                 email department   salary  \
0            1       John       Doe  john.doe@company.com         IT  75000.0
1            3       Mike   Johnson    mike.j@company.com         IT  80000.0

    hire_date
0  2020-01-15
1  2018-07-10

In [45]:
# WHERE with BETWEEN
df = pd.read_sql_query("""
SELECT * FROM employees 
WHERE salary BETWEEN 65000 AND 75000
""", conn)
print("Employees with salary between 65000 and 75000:")
print(df)
print()

Employees with salary between 65000 and 75000:
   employee_id first_name last_name                   email department  \
0            1       John       Doe    john.doe@company.com         IT
1            2       Jane     Smith  jane.smith@company.com         HR
2            4      Sarah  Williams     sarah.w@company.com      Sales
3            5        Tom     Brown       tom.b@company.com         IT
4            6      Emily     Davis     emily.d@company.com         HR

    salary   hire_date
0  75000.0  2020-01-15
1  65000.0  2019-03-20
2  70000.0  2021-02-01
3  72000.0  2020-11-15
4  68000.0  2019-09-05

In [46]:
# WHERE with IN
df = pd.read_sql_query("""
SELECT * FROM employees 
WHERE department IN ('IT', 'HR')
""", conn)
print("Employees in IT or HR:")
print(df)
print()

Employees in IT or HR:
   employee_id first_name last_name                   email department  \
0            1       John       Doe    john.doe@company.com         IT
1            2       Jane     Smith  jane.smith@company.com         HR
2            3       Mike   Johnson      mike.j@company.com         IT
3            5        Tom     Brown       tom.b@company.com         IT
4            6      Emily     Davis     emily.d@company.com         HR

    salary   hire_date
0  75000.0  2020-01-15
1  65000.0  2019-03-20
2  80000.0  2018-07-10
3  72000.0  2020-11-15
4  68000.0  2019-09-05

In [47]:
# WHERE with LIKE (pattern matching)
# % matches any sequence of characters
# _ matches any single character
df = pd.read_sql_query("""
SELECT * FROM employees 
WHERE email LIKE '%@company.com'
""", conn)
print("Employees with @company.com email:")
print(df)

Employees with @company.com email:
   employee_id first_name last_name                   email department  \
0            1       John       Doe    john.doe@company.com         IT
1            2       Jane     Smith  jane.smith@company.com         HR
2            3       Mike   Johnson      mike.j@company.com         IT
3            4      Sarah  Williams     sarah.w@company.com      Sales
4            5        Tom     Brown       tom.b@company.com         IT
5            6      Emily     Davis     emily.d@company.com         HR

    salary   hire_date
0  75000.0  2020-01-15
1  65000.0  2019-03-20
2  80000.0  2018-07-10
3  70000.0  2021-02-01
4  72000.0  2020-11-15
5  68000.0  2019-09-05

## 7. UPDATE - Modifying Data

UPDATE modifies existing records.

### Syntax:
```sql
UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition;
```

**Warning**: Always use WHERE clause, otherwise ALL records will be updated!

In [48]:
# Update a single record
cursor.execute("""
UPDATE employees
SET salary = 78000
WHERE employee_id = 1
""")
conn.commit()

df = pd.read_sql_query("SELECT * FROM employees WHERE employee_id = 1", conn)
print("Updated employee:")
print(df)
print()

Updated employee:
   employee_id first_name last_name                 email department   salary  \
0            1       John       Doe  john.doe@company.com         IT  78000.0

    hire_date
0  2020-01-15

In [49]:
# Update multiple columns
cursor.execute("""
UPDATE employees
SET department = 'Engineering', salary = salary * 1.1
WHERE department = 'IT'
""")
conn.commit()

df = pd.read_sql_query("SELECT * FROM employees WHERE department = 'Engineering'", conn)
print("Updated IT to Engineering with 10% raise:")
print(df)

Updated IT to Engineering with 10% raise:
   employee_id first_name last_name                 email   department  \
0            1       John       Doe  john.doe@company.com  Engineering
1            3       Mike   Johnson    mike.j@company.com  Engineering
2            5        Tom     Brown     tom.b@company.com  Engineering

    salary   hire_date
0  85800.0  2020-01-15
1  88000.0  2018-07-10
2  79200.0  2020-11-15

## 8. DELETE - Removing Data

DELETE removes records from a table.

### Syntax:
```sql
DELETE FROM table_name
WHERE condition;
```

**Warning**: Without WHERE, ALL records will be deleted!

In [50]:
# First, let's add a record to delete
cursor.execute("""
INSERT INTO employees VALUES 
(7, 'Test', 'User', 'test@company.com', 'Temp', 50000, '2023-01-01')
""")
conn.commit()

print("Before deletion:")
df = pd.read_sql_query("SELECT * FROM employees", conn)
print(df)
print()

Before deletion:
   employee_id first_name last_name                   email   department  \
0            1       John       Doe    john.doe@company.com  Engineering
1            2       Jane     Smith  jane.smith@company.com           HR
2            3       Mike   Johnson      mike.j@company.com  Engineering
3            4      Sarah  Williams     sarah.w@company.com        Sales
4            5        Tom     Brown       tom.b@company.com  Engineering
5            6      Emily     Davis     emily.d@company.com           HR
6            7       Test      User        test@company.com         Temp

    salary   hire_date
0  85800.0  2020-01-15
1  65000.0  2019-03-20
2  88000.0  2018-07-10
3  70000.0  2021-02-01
4  79200.0  2020-11-15
5  68000.0  2019-09-05
6  50000.0  2023-01-01

In [51]:
# Delete the test record
cursor.execute("""
DELETE FROM employees
WHERE employee_id = 7
""")
conn.commit()

print("After deletion:")
df = pd.read_sql_query("SELECT * FROM employees", conn)
print(df)

After deletion:
   employee_id first_name last_name                   email   department  \
0            1       John       Doe    john.doe@company.com  Engineering
1            2       Jane     Smith  jane.smith@company.com           HR
2            3       Mike   Johnson      mike.j@company.com  Engineering
3            4      Sarah  Williams     sarah.w@company.com        Sales
4            5        Tom     Brown       tom.b@company.com  Engineering
5            6      Emily     Davis     emily.d@company.com           HR

    salary   hire_date
0  85800.0  2020-01-15
1  65000.0  2019-03-20
2  88000.0  2018-07-10
3  70000.0  2021-02-01
4  79200.0  2020-11-15
5  68000.0  2019-09-05

## 9. ORDER BY - Sorting Results

ORDER BY sorts the result set.

### Syntax:
```sql
SELECT column1, column2, ...
FROM table_name
ORDER BY column1 [ASC|DESC], column2 [ASC|DESC];
```

- **ASC**: Ascending order (default)
- **DESC**: Descending order

In [54]:
# Order by salary ascending
df = pd.read_sql_query("""
SELECT first_name, last_name, salary 
FROM employees 
ORDER BY salary ASC
""", conn)
print("Employees ordered by salary (ascending):")
print(df)
print()

Employees ordered by salary (ascending):
  first_name last_name   salary
0       Jane     Smith  65000.0
1      Emily     Davis  68000.0
2      Sarah  Williams  70000.0
3        Tom     Brown  79200.0
4       John       Doe  85800.0
5       Mike   Johnson  88000.0

In [55]:
# Order by salary descending
df = pd.read_sql_query("""
SELECT first_name, last_name, department, salary 
FROM employees 
ORDER BY salary DESC
""", conn)
print("Employees ordered by salary (descending):")
print(df)
print()

Employees ordered by salary (descending):
  first_name last_name   department   salary
0       Mike   Johnson  Engineering  88000.0
1       John       Doe  Engineering  85800.0
2        Tom     Brown  Engineering  79200.0
3      Sarah  Williams        Sales  70000.0
4      Emily     Davis           HR  68000.0
5       Jane     Smith           HR  65000.0

In [56]:
# Order by multiple columns
df = pd.read_sql_query("""
SELECT first_name, last_name, department, salary 
FROM employees 
ORDER BY department ASC, salary DESC
""", conn)
print("Employees ordered by department, then salary:")
print(df)

Employees ordered by department, then salary:
  first_name last_name   department   salary
0       Mike   Johnson  Engineering  88000.0
1       John       Doe  Engineering  85800.0
2        Tom     Brown  Engineering  79200.0
3      Emily     Davis           HR  68000.0
4       Jane     Smith           HR  65000.0
5      Sarah  Williams        Sales  70000.0

## 10. Aggregate Functions

Aggregate functions perform calculations on multiple rows and return a single value.

### Common Functions:
- **COUNT()**: Counts rows
- **SUM()**: Adds up values
- **AVG()**: Calculates average
- **MIN()**: Finds minimum value
- **MAX()**: Finds maximum value

In [57]:
# COUNT
df = pd.read_sql_query("SELECT COUNT(*) as total_employees FROM employees", conn)
print("Total employees:")
print(df)
print()

Total employees:
   total_employees
0                6

In [60]:
# AVG, MIN, MAX, SUM
df = pd.read_sql_query("""
SELECT 
    AVG(salary) as average_salary,
    MIN(salary) as min_salary,
    MAX(salary) as max_salary,
    SUM(salary) as total_payroll
FROM employees
""", conn)
print("Salary statistics:")
print(df)

Salary statistics:
   average_salary  min_salary  max_salary  total_payroll
0         76000.0     65000.0     88000.0       456000.0

## 11. GROUP BY and HAVING

### GROUP BY
Groups rows with the same values into summary rows.

### HAVING
Filters groups (like WHERE but for groups).

### Syntax:
```sql
SELECT column1, aggregate_function(column2)
FROM table_name
GROUP BY column1
HAVING condition;
```

In [61]:
# GROUP BY
df = pd.read_sql_query("""
SELECT department, COUNT(*) as employee_count, AVG(salary) as avg_salary
FROM employees
GROUP BY department
""", conn)
print("Employees and average salary by department:")
print(df)
print()

Employees and average salary by department:
    department  employee_count    avg_salary
0  Engineering               3  84333.333333
1           HR               2  66500.000000
2        Sales               1  70000.000000

In [65]:
# GROUP BY with HAVING
df = pd.read_sql_query("""
SELECT department, COUNT(*) as employee_count, AVG(salary) as avg_salary
FROM employees
GROUP BY department
HAVING employee_count >= 2
""", conn)
print("Departments with 2 or more employees:")
print(df)

Departments with 2 or more employees:
    department  employee_count    avg_salary
0  Engineering               3  84333.333333
1           HR               2  66500.000000

## 12. JOINS

JOINS combine rows from two or more tables based on related columns.

### Types of Joins:
- **INNER JOIN**: Returns matching rows from both tables
- **LEFT JOIN**: Returns all rows from left table and matching rows from right
- **RIGHT JOIN**: Returns all rows from right table and matching rows from left
- **FULL OUTER JOIN**: Returns all rows from both tables

In [66]:
# Create a projects table for JOIN examples
cursor.execute('''
CREATE TABLE projects (
    project_id INTEGER PRIMARY KEY,
    project_name TEXT,
    employee_id INTEGER,
    budget REAL
)
''')

projects_data = [
    (1, 'Website Redesign', 1, 50000),
    (2, 'Mobile App', 3, 75000),
    (3, 'HR Portal', 2, 30000),
    (4, 'CRM System', 5, 100000),
    (5, 'Data Migration', 3, 45000)
]

cursor.executemany('INSERT INTO projects VALUES (?, ?, ?, ?)', projects_data)
conn.commit()

print("Projects table created!")

Projects table created!

In [67]:
# INNER JOIN
df = pd.read_sql_query("""
SELECT 
    e.first_name, 
    e.last_name, 
    e.department,
    p.project_name,
    p.budget
FROM employees e
INNER JOIN projects p ON e.employee_id = p.employee_id
""", conn)
print("Employees with their projects (INNER JOIN):")
print(df)
print()

Employees with their projects (INNER JOIN):
  first_name last_name   department      project_name    budget
0       John       Doe  Engineering  Website Redesign   50000.0
1       Mike   Johnson  Engineering        Mobile App   75000.0
2       Jane     Smith           HR         HR Portal   30000.0
3        Tom     Brown  Engineering        CRM System  100000.0
4       Mike   Johnson  Engineering    Data Migration   45000.0

In [68]:
# LEFT JOIN
df = pd.read_sql_query("""
SELECT 
    e.first_name, 
    e.last_name, 
    e.department,
    p.project_name
FROM employees e
LEFT JOIN projects p ON e.employee_id = p.employee_id
""", conn)
print("All employees and their projects (LEFT JOIN):")
print(df)

All employees and their projects (LEFT JOIN):
  first_name last_name   department      project_name
0       John       Doe  Engineering  Website Redesign
1       Jane     Smith           HR         HR Portal
2       Mike   Johnson  Engineering    Data Migration
3       Mike   Johnson  Engineering        Mobile App
4      Sarah  Williams        Sales              None
5        Tom     Brown  Engineering        CRM System
6      Emily     Davis           HR              None

## 13. Subqueries

A subquery is a query nested inside another query.

### Types:
- **Scalar subquery**: Returns a single value
- **Row subquery**: Returns a single row
- **Table subquery**: Returns a table

In [69]:
# Subquery in WHERE clause
df = pd.read_sql_query("""
SELECT first_name, last_name, salary
FROM employees
WHERE salary > (SELECT AVG(salary) FROM employees)
""", conn)
print("Employees with above-average salary:")
print(df)
print()

Employees with above-average salary:
  first_name last_name   salary
0       John       Doe  85800.0
1       Mike   Johnson  88000.0
2        Tom     Brown  79200.0

In [70]:
# Subquery in FROM clause
df = pd.read_sql_query("""
SELECT department, avg_sal
FROM (
    SELECT department, AVG(salary) as avg_sal
    FROM employees
    GROUP BY department
) as dept_avg
WHERE avg_sal > 70000
""", conn)
print("Departments with average salary > 70000:")
print(df)

Departments with average salary > 70000:
    department       avg_sal
0  Engineering  84333.333333

## 14. DISTINCT

DISTINCT removes duplicate rows from the result set.

### Syntax:
```sql
SELECT DISTINCT column1, column2, ...
FROM table_name;
```

In [71]:
# Get unique departments
df = pd.read_sql_query("""
SELECT DISTINCT department
FROM employees
ORDER BY department
""", conn)
print("Unique departments:")
print(df)

Unique departments:
    department
0  Engineering
1           HR
2        Sales

## 15. LIMIT and OFFSET

### LIMIT
Restricts the number of rows returned.

### OFFSET
Skips a specified number of rows before returning results.

### Syntax:
```sql
SELECT column1, column2, ...
FROM table_name
LIMIT number
OFFSET number;
```

In [72]:
# LIMIT - Get top 3 highest paid employees
df = pd.read_sql_query("""
SELECT first_name, last_name, salary
FROM employees
ORDER BY salary DESC
LIMIT 3
""", conn)
print("Top 3 highest paid employees:")
print(df)
print()

Top 3 highest paid employees:
  first_name last_name   salary
0       Mike   Johnson  88000.0
1       John       Doe  85800.0
2        Tom     Brown  79200.0

In [73]:
# LIMIT with OFFSET - Pagination
df = pd.read_sql_query("""
SELECT first_name, last_name, salary
FROM employees
ORDER BY salary DESC
LIMIT 2 OFFSET 2
""", conn)
print("Employees 3-4 by salary (pagination):")
print(df)

Employees 3-4 by salary (pagination):
  first_name last_name   salary
0        Tom     Brown  79200.0
1      Sarah  Williams  70000.0

## 16. Indexes

Indexes improve query performance by creating a data structure for faster lookups.

### Syntax:
```sql
CREATE INDEX index_name
ON table_name (column1, column2, ...);
```

### When to use:
- Columns frequently used in WHERE clauses
- Columns used in JOIN conditions
- Columns used in ORDER BY

### Trade-off:
- Faster SELECT queries
- Slower INSERT/UPDATE/DELETE operations

In [74]:
# Create an index on department column
cursor.execute("""
CREATE INDEX idx_department
ON employees(department)
""")
conn.commit()

print("Index created on department column!")
print("This will speed up queries filtering by department.")

Index created on department column!
This will speed up queries filtering by department.

## 17. Constraints

Constraints enforce rules on data in tables.

### Common Constraints:
- **PRIMARY KEY**: Uniquely identifies each record
- **FOREIGN KEY**: Links two tables together
- **UNIQUE**: Ensures all values are different
- **NOT NULL**: Ensures a column cannot have NULL values
- **CHECK**: Ensures values meet a condition
- **DEFAULT**: Sets a default value

In [75]:
# Create a table with various constraints
cursor.execute('''
CREATE TABLE products (
    product_id INTEGER PRIMARY KEY,
    product_name TEXT NOT NULL,
    sku TEXT UNIQUE NOT NULL,
    price REAL CHECK(price > 0),
    stock INTEGER DEFAULT 0,
    category TEXT NOT NULL
)
''')
conn.commit()

print("Products table created with constraints:")
print("- PRIMARY KEY on product_id")
print("- NOT NULL on product_name, sku, category")
print("- UNIQUE on sku")
print("- CHECK on price (must be > 0)")
print("- DEFAULT value 0 for stock")

Products table created with constraints:
- PRIMARY KEY on product_id
- NOT NULL on product_name, sku, category
- UNIQUE on sku
- CHECK on price (must be > 0)
- DEFAULT value 0 for stock

In [76]:
# Insert valid data
cursor.execute("""
INSERT INTO products (product_id, product_name, sku, price, category)
VALUES (1, 'Laptop', 'LAP-001', 999.99, 'Electronics')
""")
conn.commit()

df = pd.read_sql_query("SELECT * FROM products", conn)
print("Valid product inserted:")
print(df)

Valid product inserted:
   product_id product_name      sku   price  stock     category
0           1       Laptop  LAP-001  999.99      0  Electronics

## 18. Views

A view is a virtual table based on a SQL query.

### Benefits:
- Simplify complex queries
- Provide data abstraction
- Enhance security by limiting data access

### Syntax:
```sql
CREATE VIEW view_name AS
SELECT column1, column2, ...
FROM table_name
WHERE condition;
```

In [77]:
# Create a view for high earners
cursor.execute("""
CREATE VIEW high_earners AS
SELECT first_name, last_name, department, salary
FROM employees
WHERE salary > 70000
""")
conn.commit()

print("View 'high_earners' created!")

View 'high_earners' created!

In [78]:
# Query the view
df = pd.read_sql_query("SELECT * FROM high_earners ORDER BY salary DESC", conn)
print("Querying the view:")
print(df)

Querying the view:
  first_name last_name   department   salary
0       Mike   Johnson  Engineering  88000.0
1       John       Doe  Engineering  85800.0
2        Tom     Brown  Engineering  79200.0

## Summary of Key SQL Commands

### Data Definition Language (DDL):
- `CREATE TABLE` - Create new tables
- `ALTER TABLE` - Modify table structure
- `DROP TABLE` - Delete tables
- `CREATE INDEX` - Create indexes
- `CREATE VIEW` - Create views

### Data Manipulation Language (DML):
- `SELECT` - Retrieve data
- `INSERT` - Add new records
- `UPDATE` - Modify existing records
- `DELETE` - Remove records

### Data Control Language (DCL):
- `GRANT` - Give permissions
- `REVOKE` - Remove permissions

### Query Clauses:
- `WHERE` - Filter rows
- `ORDER BY` - Sort results
- `GROUP BY` - Group rows
- `HAVING` - Filter groups
- `LIMIT` - Limit results
- `OFFSET` - Skip rows

### Join Types:
- `INNER JOIN` - Matching rows only
- `LEFT JOIN` - All left rows + matching right
- `RIGHT JOIN` - All right rows + matching left
- `FULL OUTER JOIN` - All rows from both tables

### Aggregate Functions:
- `COUNT()` - Count rows
- `SUM()` - Sum values
- `AVG()` - Average values
- `MIN()` - Minimum value
- `MAX()` - Maximum value

In [ ]:
# Clean up - close the connection
conn.close()
print("Database connection closed.")

## Practice Tips

1. **Start Simple**: Begin with basic SELECT queries before moving to complex joins
2. **Always Use WHERE**: When updating or deleting, always include a WHERE clause
3. **Test First**: Use SELECT to verify which rows will be affected before UPDATE/DELETE
4. **Use Aliases**: Make queries more readable with table and column aliases
5. **Comment Your Code**: Use -- for single-line or /* */ for multi-line comments
6. **Format Queries**: Indent and organize complex queries for readability
7. **Practice Regularly**: The best way to learn SQL is by writing queries!

## Next Steps

- Practice with real databases (PostgreSQL, MySQL, SQL Server)
- Learn about transactions and ACID properties
- Study database normalization
- Explore window functions and CTEs (Common Table Expressions)
- Learn about stored procedures and triggers